package se.stream;

import java.util.ArrayList;
import java.util.Collections;
import java.util.stream.Collectors;

/**
 * @author yzh
 * @date 2019/8/7
 */
public class Test8 {
    public static void main(String[] args) {
        ArrayList<String> list = new ArrayList<>();
        Collections.addAll(list, "123", "铲屎官", "56", "56", "56", "三", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官",
                "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官",
                "铲屎官", "铲屎官", "56", "56", "56", "56", "56", "56", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官",
                "铲屎官", "铲屎官", "铲屎官", "56", "56", "56", "56", "56", "56", "56", "56", "56", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官",
                "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官",
                "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官",
                "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "56", "56", "56", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官",
                "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "123", "123", "123", "123", "123", "123", "123", "123", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官",
                "铲屎官", "铲屎官", "56", "56", "铲屎官", "铲屎官", "铲屎官", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "123", "铲屎官", "铲屎官", "铲屎官", "铲屎官", "铲屎官");
        listRemove(list);
        listAdd(list);
        stream(list);
    }

    private static void listRemove(ArrayList<String> list) {
        long l1 = System.currentTimeMillis();
        for (int i = 0; i < list.size(); i++) {
            if (list.get(i).length() >= 3) {
                list.remove(i);
                i--;
            }
        }
        System.out.println(list);
        long l = System.currentTimeMillis();
        System.out.println("使用remove耗时:" + (l - l1) + "毫秒");
    }

    private static void stream(ArrayList<String> list) {
        long l1 = System.currentTimeMillis();
        System.out.println(list.stream().filter(e -> e.length() < 3).collect(Collectors.toList()));
        long l = System.currentTimeMillis();
        System.out.println("使用stream耗时:" + (l - l1) + "毫秒");
    }

    private static void listAdd(ArrayList<String> list) {
        long l1 = System.currentTimeMillis();
        ArrayList<String> list1 = new ArrayList<>();
        for (String s : list) {
            if (s.length() < 3) {
                list1.add(s);
            }
        }
        System.out.println(list1);
        long l = System.currentTimeMillis();
        System.out.println("使用listAdd耗时:" + (l - l1) + "毫秒");
    }
}
